<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
              <integer>1</integer>
              <key>OnDemandRules</key>
              <array>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>WiFi</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>Cellular</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Disconnect</string>
                  </dict>
                </array>
                <key>AuthenticationMethod</key>
                <string>Certificate</string>
                <key>ChildSecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>DeadPeerDetectionRate</key>
                <string>Medium</string>
                <key>DisableMOBIKE</key>
                <integer>0</integer>
                <key>DisableRedirect</key>
                <integer>1</integer>
                <key>EnableCertificateRevocationCheck</key>
                <integer>0</integer>
                <key>EnablePFS</key>
                <true/>
                <key>IKESecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>LocalIdentifier</key>
                <string>guest</string>
                <key>PayloadCertificateUUID</key>
                <string>4AB80B7C-0007-5D75-8BD5-7A967F2AE65C</string>
                <key>CertificateType</key>
                <string>ECDSA384</string>
                <key>ServerCertificateIssuerCommonName</key>
                <string>13.231.129.160</string>
                <key>RemoteAddress</key>
                <string>13.231.129.160</string>
                <key>RemoteIdentifier</key>
                <string>13.231.129.160</string>
                <key>UseConfigurationAttributeInternalIPSubnet</key>
                <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.DCBF3237-EA10-581F-886D-A3832E4878D4</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>DCBF3237-EA10-581F-886D-A3832E4878D4</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>AlgoVPN AlgoTokyo01 IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>TvE4Wl8Je</string>
            <key>PayloadCertificateFileName</key>
            <string>guest.p12</string>
            <key>PayloadContent</key>
            <data>
            MIIEgQIBAzCCBEcGCSqGSIb3DQEHAaCCBDgEggQ0MIIEMDCCAtcGCSqGSIb3DQEHBqCCAsgwggLEAgEAMIICvQYJKoZIhvcNAQcBMBwGCiqGSIb3DQEMAQYwDgQI9xFohxpGIb0CAggAgIICkIDiNvmmDuGakOx/B4C1GKltQcfMbSRYJJB1Yd+oIdDnjfF+TD9uGkecVkWyCjD4BaEh9tuF9k4EQeczYjooa8s+0ZdDYeY5bB8WcSBp0MOMDlqlFD/ZFeF7FyDCZnAoZNCoajO18JSp+2EpXjX3GNOdtkJ5LsPkUt26cYVPiFtMBQhf5/N+TL7uW5v9mQSa3sKyHimwGpnKUeqsF3sgKJohGm2YHxvVccgM9naZpVRps7bGD4+rak809P6T05+dYI2afuanX/YdAik4mST1KLBRJRNU3wVthBp2M5LEh36Dg7bYcAskvEjFNCV/p6yxFBnx9I8dGQGEuxNQofPq1UKOlfgLby8Sr/SH8gW8l69j4biw015w8ues8pWwpBQY1/JjCScZtymBrDPY8XQXcmT6+65/s7D52BGRvyd8lZaHPFt0Fmfc+jvPWAYB2SSNwvFNlgxz+J+gtNyZzhsfh02zjYVbEgqxNhWUKhi4xwns2g+SBtT9VVWqYJDk6A+IQslp3wbpScI58U4FSQUtQaQYsIDv31+hyxzAFIeLBj8665V+q7r0u5agr2E3uJZJBCQe/YjKjuwkwXnn+97GZA3ag785qpoPBnlxPoKo8VVYcwIdMqz6dD3j7AcecXPqVlsghfRhRqgvmzoPkSY2BT/DyAHhHSA8ZBCvVZCLT87mRkPv9Ndjj5WSsEsBqVkx3lNm93htMfij+qKn+j8tAX0kbUwI7qA5t4hOeryoqNS905aheB77b0re5wj1LjsHsCq2XO/DwwO7tO6Kn56T/LzAP4ltJ+bDpLgUkBJonQl5rqiREVnGUaLG3HGq2NUt1BOEXFYZ8cSiwmo6docadfsl8W2XtiTj8AP3hl3He8PPMIIBUQYJKoZIhvcNAQcBoIIBQgSCAT4wggE6MIIBNgYLKoZIhvcNAQwKAQKggeQwgeEwHAYKKoZIhvcNAQwBAzAOBAh57dPJ16QLpwICCAAEgcB4osWxsHk+pPRJprugmifEGhcFL4cNb4v5tSTlmoweLbTJdLl2YOxKUzmPZQXYKQKdMQ6HrSfx60dATYE3917TmVgtpzrOD9+MRE+vdl5EBbyrJx2YKv2MYazCdJFYDMYnLg9J1R3wSxIp21BmgM8mbW4hdPc+XEda8Ytm6gmEFOsuVnXQyToTu3GK7mRuga4mczeve3RIRnEok/bzezU7X/p9dIWOVpt6zPllGLXbhNppHzKkBgQThPGL844ZyhExQDAZBgkqhkiG9w0BCRQxDB4KAGcAdQBlAHMAdDAjBgkqhkiG9w0BCRUxFgQU+XyYYt0eOYLkEKlYo0CbuazMdzIwMTAhMAkGBSsOAwIaBQAEFO+O0APhebIS+dEQFaFRB09Jgs8oBAizYDuaNjlbCwICCAA=
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.4AB80B7C-0007-5D75-8BD5-7A967F2AE65C</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>4AB80B7C-0007-5D75-8BD5-7A967F2AE65C</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUI4RENDQVhXZ0F3SUJBZ0lKQUpQWWdlNnVsZzNzTUFvR0NDcUdTTTQ5QkFNQ01Ca3hGekFWQmdOVkJBTU0KRGpFekxqSXpNUzR4TWprdU1UWXdNQjRYRFRFNU1UQXlPREV4TURNMU1Gb1hEVEk1TVRBeU5URXhNRE0xTUZvdwpHVEVYTUJVR0ExVUVBd3dPTVRNdU1qTXhMakV5T1M0eE5qQXdkakFRQmdjcWhrak9QUUlCQmdVcmdRUUFJZ05pCkFBU2g4cTFxN2tuQ2E4bVVBaTFHR2RoS2luSjVHUENialo2R05kQy9EdnNWZng0S1FwcGV6ZkpZOXJMdC8zWlIKdDVLS29Ienk3bHZrMjlzZUdKWVVQSHdSajBuN3ArN2swZjRTZ3Zmamp1MFNZM1o2NGRGc2MvbHhUS3V4elNoRgpWRFNqZ1lnd2dZVXdIUVlEVlIwT0JCWUVGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2TUVrR0ExVWRJd1JDCk1FQ0FGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2b1Iya0d6QVpNUmN3RlFZRFZRUUREQTR4TXk0eU16RXUKTVRJNUxqRTJNSUlKQUpQWWdlNnVsZzNzTUF3R0ExVWRFd1FGTUFNQkFmOHdDd1lEVlIwUEJBUURBZ0VHTUFvRwpDQ3FHU000OUJBTUNBMmtBTUdZQ01RQ2lKL1BkQ0dNR3FJa1lPc2xmMjZ0eWV4UW4xS3RlcW9ET0Q0Yzc4YTY5CmFIM2dVWjVkcjVQOTBNaTZ4TVJoOEtFQ01RRFZUZG1Bb0hiSlpxUHdmZyswTjA2VnBXUURzYVB6Y0hnamNDNm4KSGo5cElCYWRQT05mWHJiZDRXL0VrTlR4V0dVPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0t
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.A2FB4880-B3C4-53FE-A7E7-B5103EB04F3D</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>A2FB4880-B3C4-53FE-A7E7-B5103EB04F3D</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>AlgoVPN AlgoTokyo01 IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.7152CD3A-44AF-504D-B55A-2D798C3DE89B</string>
    <key>PayloadOrganization</key>
	<string>AlgoVPN</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>BA6FD047-6312-5767-AEDB-FA8A9D107482</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
