<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
              <integer>1</integer>
              <key>OnDemandRules</key>
              <array>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>WiFi</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>Cellular</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Disconnect</string>
                  </dict>
                </array>
                <key>AuthenticationMethod</key>
                <string>Certificate</string>
                <key>ChildSecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>DeadPeerDetectionRate</key>
                <string>Medium</string>
                <key>DisableMOBIKE</key>
                <integer>0</integer>
                <key>DisableRedirect</key>
                <integer>1</integer>
                <key>EnableCertificateRevocationCheck</key>
                <integer>0</integer>
                <key>EnablePFS</key>
                <true/>
                <key>IKESecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>LocalIdentifier</key>
                <string>karmen</string>
                <key>PayloadCertificateUUID</key>
                <string>313563EA-6365-5E83-9D29-F63454279E7E</string>
                <key>CertificateType</key>
                <string>ECDSA384</string>
                <key>ServerCertificateIssuerCommonName</key>
                <string>13.231.129.160</string>
                <key>RemoteAddress</key>
                <string>13.231.129.160</string>
                <key>RemoteIdentifier</key>
                <string>13.231.129.160</string>
                <key>UseConfigurationAttributeInternalIPSubnet</key>
                <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.9975D6A3-BE9E-5675-9A19-A5FC2FF4692D</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>9975D6A3-BE9E-5675-9A19-A5FC2FF4692D</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>AlgoVPN AlgoTokyo01 IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>TvE4Wl8Je</string>
            <key>PayloadCertificateFileName</key>
            <string>karmen.p12</string>
            <key>PayloadContent</key>
            <data>
            MIIEiwIBAzCCBFEGCSqGSIb3DQEHAaCCBEIEggQ+MIIEOjCCAt8GCSqGSIb3DQEHBqCCAtAwggLMAgEAMIICxQYJKoZIhvcNAQcBMBwGCiqGSIb3DQEMAQYwDgQIIonXOgIt9vUCAggAgIICmAz5A/ZjtaMidwVY+XO15bbl4nMhjfkRHuF/1Y5rt2pWE0wlwuXv+/2BZcQaQzQDAWjdU5nCaZ8qgOB5atXi26he/kLXBw8td2thewzfW0zyjrHMkAM8KG8BiJ7aFdaB6Kg5IoneJ5KpT3ZJog7N3gNloUx3WLMUmAvPqyDuP+WwlV5nzpuyDmFbRLh2a3T89cRMIV427dtaHpDQPZxf2BR9f9yNd5JH14kyulBxwwscIX1Odoa0n8bCincf8xCCp4DYSvGztzrmulheKsyvlrmxfrLEpWaUBH5iixAsnpeL+NVd8njUo94ReQ0WpYgyCPRgsqhSQrEXk6mZz5i4eh+zBs7LQ55jvVmmDgqLbtTEYABsLO1glTdSiCRo0V+uYxw/+ecsF9HQ/6ACjKl2iNqUCcEAqf6VSC2V56aHc2i1ORj1stO0aEx3AgfnVPvsnEl6kOuLHyZmWpI918PSv23FrqG86oh6cg4s+E9pknClyQygmNHFTr7rG7GDrm0AIyyivlkVZ68GuVZP+jRU4QkU8m5JFrhf+w8CN2OCiIlJ/bg6kAb6HyyC10Avu8s2XBul0KPlJeryFsY178h1UFGAyLSiy1yfkEZOt2cKrGaPzjt/RNAod6M/zA4L1clyydVvSWXjIOqM12Zd8B7gpaAqnEDdxZydMVe3IoXm0mMM3K1zbCI9nILQPLXd056Yb8l4vEfIeaset9EDmp/D7McYwdA/sGBfbAybmmmBP5w6g3kJkb/QaWD/MBr3ajcv/4FEJsAboelhMKEBxoBRq5Rdtt2lshVCa+wIhN2rQVfQwZVLGcnWxlZf4YSKRQW9GvWIQBfZyW9406C8A5EfcZQ0zoYDEvbT74UWdE3jRD5MPuIF1urhWswwggFTBgkqhkiG9w0BBwGgggFEBIIBQDCCATwwggE4BgsqhkiG9w0BDAoBAqCB5DCB4TAcBgoqhkiG9w0BDAEDMA4ECF+gXYE/V/3mAgIIAASBwG1ZV6p27yx72KBJPdRrVUpZeKO9H2mmHNtpCMBl4Km3a/mvgKo57qJx2/dtCfvti6/KE0Y4xCppSWo6/S2rAw8/ipmGFpg0s2DHrakLuhzxyM/GmTxBxRLjLSrnqr5D8NJywOZjAvLRzgj8Oe3oQua1kiWNQ/riOIQCSr/lE+mOhs1B0uuWR6qyVrn7t8Q71Jca19spzNz0e3IFI+w/GYzkW6oZMMiQiAhr95qTrLIpdCkMVRZ7vqn3Zj0yjsc+HTFCMBsGCSqGSIb3DQEJFDEOHgwAawBhAHIAbQBlAG4wIwYJKoZIhvcNAQkVMRYEFOeb84oDJN6ejL7GsV9h1/j+rlXOMDEwITAJBgUrDgMCGgUABBQQCKr06xeZuq+gCq7eosJ/WqtLdQQI+eIxl5TjWF4CAggA
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.313563EA-6365-5E83-9D29-F63454279E7E</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>313563EA-6365-5E83-9D29-F63454279E7E</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUI4RENDQVhXZ0F3SUJBZ0lKQUpQWWdlNnVsZzNzTUFvR0NDcUdTTTQ5QkFNQ01Ca3hGekFWQmdOVkJBTU0KRGpFekxqSXpNUzR4TWprdU1UWXdNQjRYRFRFNU1UQXlPREV4TURNMU1Gb1hEVEk1TVRBeU5URXhNRE0xTUZvdwpHVEVYTUJVR0ExVUVBd3dPTVRNdU1qTXhMakV5T1M0eE5qQXdkakFRQmdjcWhrak9QUUlCQmdVcmdRUUFJZ05pCkFBU2g4cTFxN2tuQ2E4bVVBaTFHR2RoS2luSjVHUENialo2R05kQy9EdnNWZng0S1FwcGV6ZkpZOXJMdC8zWlIKdDVLS29Ienk3bHZrMjlzZUdKWVVQSHdSajBuN3ArN2swZjRTZ3Zmamp1MFNZM1o2NGRGc2MvbHhUS3V4elNoRgpWRFNqZ1lnd2dZVXdIUVlEVlIwT0JCWUVGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2TUVrR0ExVWRJd1JDCk1FQ0FGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2b1Iya0d6QVpNUmN3RlFZRFZRUUREQTR4TXk0eU16RXUKTVRJNUxqRTJNSUlKQUpQWWdlNnVsZzNzTUF3R0ExVWRFd1FGTUFNQkFmOHdDd1lEVlIwUEJBUURBZ0VHTUFvRwpDQ3FHU000OUJBTUNBMmtBTUdZQ01RQ2lKL1BkQ0dNR3FJa1lPc2xmMjZ0eWV4UW4xS3RlcW9ET0Q0Yzc4YTY5CmFIM2dVWjVkcjVQOTBNaTZ4TVJoOEtFQ01RRFZUZG1Bb0hiSlpxUHdmZyswTjA2VnBXUURzYVB6Y0hnamNDNm4KSGo5cElCYWRQT05mWHJiZDRXL0VrTlR4V0dVPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0t
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.6CF68124-8984-59F6-8D47-6282450AEB9B</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>6CF68124-8984-59F6-8D47-6282450AEB9B</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>AlgoVPN AlgoTokyo01 IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.83150A1D-7E3B-5E5F-8AA9-106C02439E30</string>
    <key>PayloadOrganization</key>
	<string>AlgoVPN</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>10EDE2D4-B484-5BA2-8118-136E8EB630DF</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
