<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
              <integer>1</integer>
              <key>OnDemandRules</key>
              <array>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>WiFi</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                    <key>InterfaceTypeMatch</key>
                      <string>Cellular</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Disconnect</string>
                  </dict>
                </array>
                <key>AuthenticationMethod</key>
                <string>Certificate</string>
                <key>ChildSecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>DeadPeerDetectionRate</key>
                <string>Medium</string>
                <key>DisableMOBIKE</key>
                <integer>0</integer>
                <key>DisableRedirect</key>
                <integer>1</integer>
                <key>EnableCertificateRevocationCheck</key>
                <integer>0</integer>
                <key>EnablePFS</key>
                <true/>
                <key>IKESecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>1440</integer>
                </dict>
                <key>LocalIdentifier</key>
                <string>robb</string>
                <key>PayloadCertificateUUID</key>
                <string>2BFBF728-CCA2-5E33-9277-F838694817CE</string>
                <key>CertificateType</key>
                <string>ECDSA384</string>
                <key>ServerCertificateIssuerCommonName</key>
                <string>13.231.129.160</string>
                <key>RemoteAddress</key>
                <string>13.231.129.160</string>
                <key>RemoteIdentifier</key>
                <string>13.231.129.160</string>
                <key>UseConfigurationAttributeInternalIPSubnet</key>
                <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.E14AB3EF-75FA-5AA3-8E3D-1D5110F99975</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>E14AB3EF-75FA-5AA3-8E3D-1D5110F99975</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>AlgoVPN AlgoTokyo01 IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>TvE4Wl8Je</string>
            <key>PayloadCertificateFileName</key>
            <string>robb.p12</string>
            <key>PayloadContent</key>
            <data>
            MIIEfwIBAzCCBEUGCSqGSIb3DQEHAaCCBDYEggQyMIIELjCCAtcGCSqGSIb3DQEHBqCCAsgwggLEAgEAMIICvQYJKoZIhvcNAQcBMBwGCiqGSIb3DQEMAQYwDgQI33RbJcxV1Y8CAggAgIICkLOQBLe9KR7SqHEeimnJW5pvfDzg74i6k090Onb/Tw9xACvI/KqLGP6tNykm8Z2jvyoV7oZ/eJsryYknJOBCJs/9lVPSF1dQjfKeQ2q3pebjCkvegYAPT9SxvqJFfWRGsVR+hupt0v85AH236JRF7XOPjgESFN1Hr8cbf8OGKbu0E3pLCyJzQBy8zAIEI87ORrN0KP6tjpe+LoHHuLBM0IdVMLOd+839G8F+vuEyONxAcMFQYLskgI+haMSpgjJbEyxIdNuRtzSzJ2Z4n5GBYn2NGK2FTidXTwyp7qU6ICEd+NX5DdvUX6X70tnkl1gLB/GBNg/sEDvQ5HbpstF+FAekOmiw06yeOdN+npantvubs8gk7CPQaxrroYKNdeEu94zBitxb4gtqQK6ZXL9eeeB7aThlyNv8BUy2SCKfRGWig3nOs5GSgeaFIEky3/Q0QpgvxNL/aNfrXSH9WSnttnduyYnWQ1klhNyYCsCQSks6L2ss+WgJJDF7AA59h0UCkyl3B6Jiouyv/YorFrmx/KO3n42q08FJHIu76RXTyXh7TWC6DU6doBgoXLKI1VjaQso7DVzInWNmwVHNGBRQwkC9PTDHld3gG+XkGN3A0AsvWRclh0Bs8Clr9aY0FerB0w7p3SAfDi0VqPvSKEbccuL/V2+vAEJi0F2OaatJkilqFmdZumlsSiFfGLN5MbEmlehjd1u1juSG9Dosgt57OC0dS3Qziar9Pp039g+bMjZjSJQd2vPmVV2THkqecyQJCg5e+7PJAxGBduHW+fFma/f9w8SMJ9m1fB9TkYl9vbmCDeYODiplyrIhh5FjeZMd2mAMxONjTGjxsctt6lDbxDrnH/1IfyoUzQ7sEeoG0PE8MIIBTwYJKoZIhvcNAQcBoIIBQASCATwwggE4MIIBNAYLKoZIhvcNAQwKAQKggeQwgeEwHAYKKoZIhvcNAQwBAzAOBAgXKg7viCwVWgICCAAEgcDk3Qgd6kpp+ZZxuc2Lc2LPd0v+ESYO96/qk120zX3h9G0lnLFoIXhxp9xDuTXlDndib+KdZLD/yX1+DZu68+P7W/AOO1jnNqOD+F82BqNW9THfG6poS8pvFP4jhlOtYRcRcjEs5rlMEX6xL4OUGnqhhZrbMqieyDXoJbSSYJUGAhTYGPoz8IqR0g3w6OzRSqOHD4cqvorCK3ly0joO1TULtrFoRBZBNV4ox34ofQejlMUUMeUtdK5+E0n5qfXZiOAxPjAXBgkqhkiG9w0BCRQxCh4IAHIAbwBiAGIwIwYJKoZIhvcNAQkVMRYEFN4KKDdVt7vDGoOdr0F8iJaGqSEQMDEwITAJBgUrDgMCGgUABBR5xrokL7E1KGNIYRyxYQceH22NTwQI42QgT5/bHMQCAggA
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.2BFBF728-CCA2-5E33-9277-F838694817CE</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>2BFBF728-CCA2-5E33-9277-F838694817CE</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUI4RENDQVhXZ0F3SUJBZ0lKQUpQWWdlNnVsZzNzTUFvR0NDcUdTTTQ5QkFNQ01Ca3hGekFWQmdOVkJBTU0KRGpFekxqSXpNUzR4TWprdU1UWXdNQjRYRFRFNU1UQXlPREV4TURNMU1Gb1hEVEk1TVRBeU5URXhNRE0xTUZvdwpHVEVYTUJVR0ExVUVBd3dPTVRNdU1qTXhMakV5T1M0eE5qQXdkakFRQmdjcWhrak9QUUlCQmdVcmdRUUFJZ05pCkFBU2g4cTFxN2tuQ2E4bVVBaTFHR2RoS2luSjVHUENialo2R05kQy9EdnNWZng0S1FwcGV6ZkpZOXJMdC8zWlIKdDVLS29Ienk3bHZrMjlzZUdKWVVQSHdSajBuN3ArN2swZjRTZ3Zmamp1MFNZM1o2NGRGc2MvbHhUS3V4elNoRgpWRFNqZ1lnd2dZVXdIUVlEVlIwT0JCWUVGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2TUVrR0ExVWRJd1JDCk1FQ0FGQ1pxT2tCNklZQkYydnBnMDVSRFArdlNtM0p2b1Iya0d6QVpNUmN3RlFZRFZRUUREQTR4TXk0eU16RXUKTVRJNUxqRTJNSUlKQUpQWWdlNnVsZzNzTUF3R0ExVWRFd1FGTUFNQkFmOHdDd1lEVlIwUEJBUURBZ0VHTUFvRwpDQ3FHU000OUJBTUNBMmtBTUdZQ01RQ2lKL1BkQ0dNR3FJa1lPc2xmMjZ0eWV4UW4xS3RlcW9ET0Q0Yzc4YTY5CmFIM2dVWjVkcjVQOTBNaTZ4TVJoOEtFQ01RRFZUZG1Bb0hiSlpxUHdmZyswTjA2VnBXUURzYVB6Y0hnamNDNm4KSGo5cElCYWRQT05mWHJiZDRXL0VrTlR4V0dVPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0t
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>AlgoTokyo01</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.8720602B-321D-5746-BC1B-4ACA2328F8A6</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>8720602B-321D-5746-BC1B-4ACA2328F8A6</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>AlgoVPN AlgoTokyo01 IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.23ACD7FC-5B8D-5F91-98AC-67A5A96562DB</string>
    <key>PayloadOrganization</key>
	<string>AlgoVPN</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>A9868751-84C5-58DD-B774-8C5E00E2FB61</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
